## Dot Product Exmple

Student marks

In [1]:
import numpy as np

In [4]:
np.random.seed(0)
student_marks = np.random.randint(100,size = (4,6))
student_marks

array([[44, 47, 64, 67, 67,  9],
       [83, 21, 36, 87, 70, 88],
       [88, 12, 58, 65, 39, 87],
       [46, 88, 81, 37, 25, 77]], dtype=int32)

In [6]:
student = np.DataFrame(student_marks , index =["Jhon", "Alex", "Joy", "Robb"], colums=["Maths", "Scinece", "Biology", "Physices", "Computer Scinece", "Chemistry"])
student

AttributeError: module 'numpy' has no attribute 'DataFrame'

In [7]:
import pandas as pd

In [9]:
student = pd.DataFrame(student_marks , index =["Jhon", "Alex", "Joy", "Robb"], columns=["Maths", "Scinece", "Biology", "Physices", "Computer Scinece", "Chemistry"])
student

      Maths  Scinece  Biology  Physices  Computer Scinece  Chemistry
Jhon     44       47       64        67                67          9
Alex     83       21       36        87                70         88
Joy      88       12       58        65                39         87
Robb     46       88       81        37                25         77

In [10]:
weights = [1, 1, 1, 1, 1, 1]

In [11]:
student["Total_scroe"] = student.dot(weights)

In [13]:
student

,Maths,Scinece,Biology,Physices,Computer Scinece,Chemistry,Total_scroe
Jhon,44,47,64,67,67,9,298
Alex,83,21,36,87,70,88,385
Joy,88,12,58,65,39,87,349
Robb,46,88,81,37,25,77,354

Car Performance Score using DOT PRODUCT

In [23]:
np.random.seed(0)
car_data = np.random.randint(20,size=(4,6))
car_data

array([[12, 15,  0,  3,  3,  7],
       [ 9, 19, 18,  4,  6, 12],
       [ 1,  6,  7, 14, 17,  5],
       [13,  8,  9, 19, 16, 19]], dtype=int32)

In [24]:
columns = [
    "Mileage_kmpl",
    "Engine_HP",
    "Safety_Rating",
    "Comfort_Rating",
    "Maintenance_Cost",
    "Resale_Value"
]

In [25]:
car = pd.DataFrame(car_data, index = ["car_A", "car_B", "car_C", "car_D"],
                  columns = columns)
car

,Mileage_kmpl,Engine_HP,Safety_Rating,Comfort_Rating,Maintenance_Cost,Resale_Value
car_A,12,15,0,3,3,7
car_B,9,19,18,4,6,12
car_C,1,6,7,14,17,5
car_D,13,8,9,19,16,19

In [26]:
range = [
    0.20,   # Mileage
    0.25,   # Engine power
    0.20,   # Safety
    0.15,   # Comfort
   -0.10,   # Maintenance cost (negative impact)
    0.10    # Resale value
]
range

[0.2, 0.25, 0.2, 0.15, -0.1, 0.1]

In [28]:
car["Performance_Score"] = car.dot(range)

In [29]:
car

,Mileage_kmpl,Engine_HP,Safety_Rating,Comfort_Rating,Maintenance_Cost,Resale_Value,Performance_Score
car_A,12,15,0,3,3,7,7.00
car_B,9,19,18,4,6,12,11.35
car_C,1,6,7,14,17,5,4.00
car_D,13,8,9,19,16,19,9.55